; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	spectrograph8 - mode
	spectrograph1 - mode
	infrared5 - mode
	infrared4 - mode
	infrared6 - mode
	infrared7 - mode
	infrared0 - mode
	spectrograph3 - mode
	image2 - mode
	Star0 - direction
	Star4 - direction
	GroundStation3 - direction
	Star5 - direction
	Star2 - direction
	GroundStation1 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 infrared4)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 spectrograph8)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared6)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star4)
	(supports instrument6 infrared7)
	(supports instrument6 image2)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument7 infrared5)
	(supports instrument7 infrared0)
	(supports instrument7 infrared4)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite2 Star5)
	(pointing satellite3 Star2)
	(have_image Star6 infrared7)
	(have_image Star6 infrared6)
	(have_image Star7 spectrograph1)
	(have_image Star7 infrared6)
	(have_image Star7 infrared0)
	(have_image Phenomenon8 image2)
	(have_image Phenomenon8 infrared7)
	(have_image Star9 spectrograph3)
	(have_image Star9 infrared7)
	(have_image Star9 infrared5)
	(have_image Planet10 infrared0)
	(have_image Planet10 spectrograph3)
	(have_image Planet10 infrared4)
))

)

; plan
1. (turn_to satellite3 groundstation1 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 16
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 16
3. (calibrate satellite3 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 16
4. (turn_to satellite3 star7 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star7)
   goals met: 0 of 16
5. (take_image satellite3 star7 instrument7 infrared0)
   added: (have_image star7 infrared0)
   goals met: 1 of 16
6. (turn_to satellite3 planet10 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet10)
   goals met: 1 of 16
7. (turn_to satellite2 groundstation3 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 16
8. (turn_to satellite1 groundstation1 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 16
9. (turn_to satellite0 groundstation1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 16
10. (take_image satellite3 planet10 instrument7 infrared4)
   added: (have_image planet10 infrared4)
   goals met: 2 of 16
11. (take_image satellite3 planet10 instrument7 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 3 of 16
12. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 3 of 16
13. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 16
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 16
15. (calibrate satellite2 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 3 of 16
16. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 3 of 16
17. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 3 of 16
18. (turn_to satellite0 star7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star7)
   goals met: 3 of 16
19. (take_image satellite0 star7 instrument0 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 4 of 16
20. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 5 of 16
21. (turn_to satellite1 planet10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet10)
   goals met: 5 of 16
22. (take_image satellite1 planet10 instrument2 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 6 of 16
23. (turn_to satellite1 star9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star9)
   goals met: 6 of 16
24. (take_image satellite1 star9 instrument2 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 7 of 16
25. (turn_to satellite2 star6 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star6)
   goals met: 7 of 16
26. (take_image satellite2 star6 instrument5 infrared6)
   added: (have_image star6 infrared6)
   goals met: 8 of 16
27. (turn_to satellite2 star7 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star7)
   goals met: 8 of 16
28. (take_image satellite2 star7 instrument5 infrared6)
   added: (have_image star7 infrared6)
   goals met: 9 of 16
29. (switch_off instrument5 satellite2)
   deleted: (power_on instrument5)
   added: (power_avail satellite2)
   goals met: 9 of 16
30. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 9 of 16
31. (turn_to satellite2 star2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star2)
   goals met: 9 of 16
32. (calibrate satellite2 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 9 of 16
33. (turn_to satellite2 phenomenon8 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon8)
   goals met: 9 of 16
34. (take_image satellite2 phenomenon8 instrument6 image2)
   added: (have_image phenomenon8 image2)
   goals met: 10 of 16
35. (take_image satellite2 phenomenon8 instrument6 infrared7)
   added: (have_image phenomenon8 infrared7)
   goals met: 11 of 16
36. (turn_to satellite2 star6 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star6)
   goals met: 11 of 16
37. (take_image satellite2 star6 instrument6 infrared7)
   added: (have_image star6 infrared7)
   goals met: 12 of 16
38. (turn_to satellite2 star9 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star9)
   goals met: 12 of 16
39. (take_image satellite2 star9 instrument6 infrared7)
   added: (have_image star9 infrared7)
   goals met: 13 of 16
40. (turn_to satellite2 star5 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star5)
   goals met: 14 of 16
41. (turn_to satellite3 star9 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star9)
   goals met: 14 of 16
42. (take_image satellite3 star9 instrument7 infrared5)
   added: (have_image star9 infrared5)
   goals met: 15 of 16
43. (turn_to satellite3 star2 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star2)
   goals met: 16 of 16
